# **#13 Konversi nilai numerik ke dalam sejumlah kategori**

**Import Modules**

In [3]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

**Persiapan Data Frame**

In [5]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    38
1    56
2    17
3    90
4    73
5     6
6    98
7    73
8    32
9    90

**Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()**

- Membuat kolom baru bernama 'kelompok_usia'
- Fungsi cut() akan memisahkan data dan mengelompokkannya sesuai dengan kelompoknya
- df adalah kolom usia yang ingin kita cut
- Rentang 0-18 akan memiliki label anak
- Rentang 18 - 65 akan memiliki label dewasa
- Rentang 65 - 99 akan memiliki label manula

In [7]:
#Menggunakan metode cut dari pandas untuk membuat kolom 'kelompok_usia' berdasarkan kolom
#Parameter bins digunakan untuk menentukan batas kelompok usia dalam bentuk list 
#Parameter labels digunakan untuk memberikan label pada masing masing kelompok usia 
df['Kelompok usia'] = pd.cut(df['usia'],
                             bins = [0,18, 65, 99],
                             labels = ['anak', 'dewasa', 'manula'])

#Menampilkan data frame dengan tambahan kolom 'kelompok usia'
df

   usia Kelompok usia
0    38        dewasa
1    56        dewasa
2    17          anak
3    90        manula
4    73        manula
5     6          anak
6    98        manula
7    73        manula
8    32        dewasa
9    90        manula

# **#14 Menggabungkan (merge) dua Data Frame**

**Import Modules**

In [9]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

**Persiapan Data Frame**

In [13]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df.head()

    A   B   C   D   E
0   2   2   7  10   8
1  18  14   1  15  13
2  16   9   8  11   7
3   8   8  12  16  12
4   9   8   1  12   2

In [15]:
#Membuat salinan mendalam dari data frame df dan menyimpannya dalam variable df1
df1 = df.copy(deep=True)

#Menggunakan metode drop untuk menghapus baris dengan indeks 1 dan 4 dari data frame df1
df1 = df1.drop([1, 4])

#Menampilkan data frame df1 setelah penghapusan baris dengan indeks 1 dan 4
df1

    A  B   C   D   E
0   2  2   7  10   8
2  16  9   8  11   7
3   8  8  12  16  12

In [17]:
#Membuat salinan mendalam dari data frame df dan menyimpannya dalam variabe df2
df2 =  df.copy(deep=True)

#Menggunakan metode drop untuk menghapus baris dengan indeks 0 dan 3 dari data frame df2
df2 = df2.drop([0, 3])

#Menampilkan data frame df2 setelah penghapusan baris dengan indeks 0 dan 3
df2

    A   B  C   D   E
1  18  14  1  15  13
2  16   9  8  11   7
4   9   8  1  12   2

**Menggabungkan dua Data Frame**

- Kita akan menggunakan 2 cara dari fungsi merge() ini, yaitu secara inner dan outer
- Parameter ke-3 dapat diatur dengan how menjadi inner, Karena itu akan menghasilkan irisan dari dataframe yang kita pilih
- Namun, jika kita mengatur parameter tersebut menjadi outer, itu akan menghasilkan gabungan dari data frame yang kita pilih
- Perlu diingat indeks pada gabungan data frame akan dibuat ulang

In [25]:
#Menggunakan metode merge dari pandas untuk menggabungkan dua data frame (df1 dan df2) berdasarkan indeks
#Parameter how=inner digunakan untuk menentukkan jenis join yang dilakukan, dalam hal ini inner join
df_inner = pd.merge(df1, df2, how='inner')

#Menampilkan hasil penggabungan data frame df1 dan df2 dengan inner join
df_inner

    A  B  C   D  E
0  16  9  8  11  7

In [29]:
#Menggunakan metode merge dari pandas untuk menggabungkan dua data frame (df1 dan df2) berdasarkan indeks
#Parameter how=outer digunakan untuk menentukkan jenis join yang dilakukan, dalam hal ini outer join
df_outer = pd.merge(df1, df2, how='outer')

#Menampilkan hasil penggabungan data frame df1 dan df2 dengan outer join
df_outer

    A   B   C   D   E
0   2   2   7  10   8
1   8   8  12  16  12
2   9   8   1  12   2
3  16   9   8  11   7
4  18  14   1  15  13

# **#15 Memecah nilai String dari suatu kolom ke dalam beberapa kolom baru**

**Import Modules**

In [1]:
import pandas as pd

print(pd.__version__)

2.2.2

**Persiapan Data Frame**

In [3]:
#Membuat data frame menggunakan dictionary sebagai sumber datanya 
#Data frame memiliki dua kolom, 'nama' dan 'temapt_kelahiran'
data = {'nama':['Didi Kempot', 'Glenn Fredly', 'Mbah Surip'],
        'tempat_kelahiran':['Surakarta, Jawa Tengah', 'Jakarta, DKI Jakarta', 'Mojokerto, Jawa Timur']}

df = pd.DataFrame(data)

#Menampilkan data frame yang telah dibuat
df

           nama        tempat_kelahiran
0   Didi Kempot  Surakarta, Jawa Tengah
1  Glenn Fredly    Jakarta, DKI Jakarta
2    Mbah Surip   Mojokerto, Jawa Timur

**Memecah nama depan dan nama belakang**

- Buatlah 2 kolom baru
- Memisahkan kolom nama dengan fungsi split()
- Parameter kedua (tambahan) fungsi split() di beri nilai true agar output dapat berupa multiple columns

In [5]:
#Menggunakan metode str.split untuk membagi kolom nama menjadi dua kolom
df[['nama_depan', 'nama_belakang']] = df['nama'].str.split(' ', expand=True)

#Menampilkan data frame dengan tambahan dua kolom baru, nama depan dan nama belakang
df

           nama        tempat_kelahiran nama_depan nama_belakang
0   Didi Kempot  Surakarta, Jawa Tengah       Didi        Kempot
1  Glenn Fredly    Jakarta, DKI Jakarta      Glenn        Fredly
2    Mbah Surip   Mojokerto, Jawa Timur       Mbah         Surip

**Memecah nama kota dan provinsi**

- Buatlah 2 kolom baru
- Memisahkan kolom nama dengan fungsi split()
- Untuk memisahkan, pastikan gunakan koma yang diatur pada parameter pertama fungsi split
- Parameter kedua (tambahan) fungsi split diberi nilai true agar output dapat berupa multiple columns

In [7]:
#Menggunakan metode str.split() untuk membagi kolom tempat kelahiran
df[['kota', 'provinsi']] = df['tempat_kelahiran'].str.split(',', expand=True)

#Menampilkan data frame dengan tambahan dua kolom baru, kota dan provinsi
df

,nama,tempat_kelahiran,nama_depan,nama_belakang,kota,provinsi
0,Didi Kempot,"Surakarta, Jawa Tengah",Didi,Kempot,Surakarta,Jawa Tengah
1,Glenn Fredly,"Jakarta, DKI Jakarta",Glenn,Fredly,Jakarta,DKI Jakarta
2,Mbah Surip,"Mojokerto, Jawa Timur",Mbah,Surip,Mojokerto,Jawa Timur

## **#16 Menata ulang Data Frame dengan multiple indexes menggunakan unstack()**

**Import Modules**

In [9]:
import pandas as pd

print(pd.__version__)

2.2.2

**Persiapan Data Frame**

In [ ]:
#Menggunakan metode read_csv dari pandas untuk membaca file CSV dan menyimpannya dalam data frame df
df = pd.read_csv('./data/titanicfull.csv')

#Menampilkan lima data awal dari data frame
df.head()

**Data Frame dengan multiple indexes dari hasil grouping**

- Data dikelompokkan kedalam beberapa kelompok berdasarkan sex dan pclass
- Data yang diamati sekarang adalah survived dimana 0 untuk tidak selamat dan 1 untuk selamat
- Karena survived sudah dikelompokkan kedalam sex dan pclass, kita tidak dapat mengakses nilai tersebut kembali
- Fungsi to_frame() hanya untuk mempercantik output tampilan

In [ ]:
#Menggunakan metode groupby dari pandas untuk mengelompokkan data berdasarkan 'sex' dan 'place'
#Kemudian menggunakan kolom 'survived' sebagai target untuk menghitung rata rata 
#Metode unstack digunakan untuk mengubah hasil groupby menjadi bentuk yang lebih besar 
df .groupby(['sex', 'place'])['survived'].mean().to_frame()